

** preamble
#+name:pm4py4test-set_cleaning_params
#+BEGIN_SRC jupyter-python :session final :eval yes :display plain :var istring = "usedonitsown" decreasingFactor = 1 keep_percent =1
nil=0
cleaning_parameters = [istring,decreasingFactor,keep_percent]
import os
here = "./"+istring+"/"
try:
    os.mkdir(here)
except:
    pass
#cleaning_parameters
#+END_SRC




#+name:pm4py4test-preamble
#+BEGIN_SRC jupyter-python :session final :results raw
import pickle
import pandas as pd
import numpy as np 
import pm4py
import string
import scipy.stats as st
np.set_printoptions(precision=3,linewidth=270,sign=" ",suppress=False)
import matplotlib as mpl
import matplotlib.pyplot as plt
from tabulate import tabulate
import copy
nil = 0
printorgtable = lambda tbl: print(tabulate(tbl,headers="keys",tablefmt="latex_raw"))
#+END_SRC



pm4py imports go here
#+name:pm4py4test-preamble-pm4py
#+BEGIN_SRC jupyter-python :session final
from pm4py.objects.log.adapters.pandas import csv_import_adapter
from pm4py.objects.conversion.log import factory as conversion_factory
from pm4py.objects.log.importer.csv import factory as csv_importer
import pm4py.objects.log.util.prefix_matrix as prefix_stuff
from pm4py.objects.log.util.get_prefixes import get_log_with_log_prefixes
from pm4py.objects.conversion.log.versions import to_dataframe
from pm4py.objects.conversion.log import factory as log_conv_factory
from pm4py.objects.log.util import get_log_representation
from pm4py.objects.petri.reachability_graph import construct_reachability_graph
import pm4py.objects.petri.check_soundness as soundness


from pm4py.algo.conformance.tokenreplay import factory as token_replay
from pm4py.algo.conformance.tokenreplay import diagnostics 
from pm4py.algo.discovery.dfg import factory as dfg_factory
from pm4py.algo.discovery.inductive import factory as inductive_miner





from pm4py.visualization.process_tree import factory as pt_vis_factory
from pm4py.visualization.petrinet import factory as pn_vis_factory
from pm4py.visualization.petrinet.util.vis_trans_shortest_paths import get_decorations_from_dfg_spaths_acticount
from pm4py.visualization.petrinet.util.vis_trans_shortest_paths import get_shortest_paths
from pm4py.visualization.petrinet.util import performance_map

import pm4py.algo.filtering.pandas as pdfilter 




from pm4py.algo.filtering.log.attributes import attributes_filter
from pm4py.algo.filtering.log.variants import variants_filter as vfilter

import pm4py.statistics.traces.pandas.case_statistics as pdtrix

from pm4py.util import constants
import copy

#+END_SRC

#+RESULTS:
#+name:pm4py4test-import_consts
#+BEGIN_SRC jupyter-python :session final :display plain noweb=yes 
import pm4py.algo.filtering.log.attributes.attributes_filter
#idstring = "bigdataframe"
acceptreject = lambda b: "accepted" if b==True else "rejected" 

consts = [
constants.PARAMETER_CONSTANT_ACTIVITY_KEY,
constants.PARAMETER_CONSTANT_ATTRIBUTE_KEY,
constants.PARAMETER_CONSTANT_CASEID_KEY,
constants.PARAMETER_CONSTANT_RESOURCE_KEY,
constants.PARAMETER_CONSTANT_START_TIMESTAMP_KEY,
constants.PARAMETER_CONSTANT_TIMESTAMP_KEY,
constants.PARAMETER_CONSTANT_TRANSITION_KEY]
#pdb.set_trace()

name_dict = {"activity":"concept:name",
            "attr1":"case:responsible",
	    "case":"case:concept:name",
            "t_stamp":"time:timestamp"
}

par_dict = {consts[0]:"concept:name",
            consts[1]:"case:responsible",
	    consts[2]:"case:concept:name",
            consts[6]:"time:timestamp"
	   # consts[5]:"case:startdate"
}


idstring = cleaning_parameters[0]
par_dict["decreasingFactor"]=cleaning_parameters[1]
par_dict["keep_percent"] = cleaning_parameters[2]

idstring = idstring + "{}pc_{}df".format(int(par_dict["keep_percent"]*100),int(par_dict["decreasingFactor"]*100))
print(idstring)

#par_dict["decreasingFactor"] = 0.6 
#idstring = idstring + str(int(par_dict["decreasingFactor"]*100)) + "pc"
par_dict_pd = par_dict

#par_dict_pd["max_variants_to_return"] = 20
#+end_src



**** finding more than fitness
#+name:pm4py4test-petrimeasures_alignment
#+BEGIN_SRC jupyter-python :session final 
# measure precision (through a variant of the ETConformance algorithm)
from pm4py.evaluation.precision import factory as precision_factory
from pm4py.evaluation.simplicity import factory as simplicity_factory
from pm4py.evaluation.generalization import factory as generalization_factory

precision = precision_factory.apply(log, net, initial_marking,final_marking,parameters=par_dict)
print(precision)


# measure generalization (through Bujis technique)

generalization = generalization_factory.apply(log, net, initial_marking,final_marking,parameters=par_dict)
print(generalization)


# measure simplicity (through arc degree)

simplicity = simplicity_factory.apply(net,parameters=par_dict)
print(simplicity)

netsummary = {"Fitness":perc_fitness,"Simplicity":simplicity,"Generalisation":generalization,"Ratio of traces used":len(log)/len(log_prefilter),"Percentage of most frequent variants":keep_percent,"Decreasing Factor":par_dict["decreasingFactor"]}

netsummarydf = pd.DataFrame.from_dict(netsummary,orient="index",columns=["Values"])
netsummarydf.to_pickle(here+idstring+"netsummarydf.pkl")
#+END_SRC

#+name:pm4py4test-fitness_alignment-prefilter
 #+BEGIN_SRC jupyter-python :session final 
par_dict["enable_pltr_fitness"] = True
aligned_traces, place_fitness, trans_fitness, notexisting_activities_in_model= token_replay.apply(log, net, initial_marking, final_marking,parameters=par_dict) 
fit_traces = [x for x in aligned_traces if x['trace_is_fit']]
unfit_traces = [x for x in aligned_traces if not x["trace_is_fit"]]

perc_fitness = 0.00
if len(aligned_traces) > 0:
    perc_fitness = len(fit_traces) / len(aligned_traces)
print("fitness=", perc_fitness)

 #+END_src

 #+RESULTS: pm4py4test-fitness_alignment
 : fitness= 1.0





**** old transition dataframe
#+name:pm4py4test-fitness_df_old
#+BEGIN_SRC jupyter-python :session final  :display plain
#pd.DataFrame.from_dict(transition_dict,orient="index"). works with {key:(x,y,z)} dicts

transitiondf = pd.DataFrame.from_dict(transition_dict,orient="index").transpose().unstack(level=1).reorder_levels([1,0]).reset_index()
transitiondf.drop(columns="level_0",inplace=True)
#i would use orient=column here but this way it fills the empty times with NaNs.
transitiondf.columns=["transition","time","weight"]
transitiondf["transition"] = transitiondf["transition"].astype("category",inplace=True)
#replace all the nans in a groups with the mean of that group.
transitiondf["time"] = transitiondf.groupby("transition")["time"].transform(lambda ser: ser.fillna(ser.mean()))
#removes nas left - ie. the transitions that are only an empty list.
transitiondf["time"].fillna(0,inplace=True)

isbad = transitiondf.groupby("transition")["time"].max()<0.001
transitiondf = transitiondf.join(isbad,on="transition",rsuffix="isbad")
transitiondfgt0 = transitiondf[transitiondf["timeisbad"]==False]
#removes transitions where the transition time never goes above 0.
#cleans up the graphs quite a bit.
#transitiondfgt0["transition"].cat.remove_unused_categories(inplace=True)
print(transitiondfgt0.loc[transitiondfgt0["transition"]=="d",:].head())
print(transitiondfgt0["transition"].cat.categories)
#okay given we're no longer working within the tidy framework, this is wheree we go from here.
#we just work with rawdf and the weights and fit from there.
#needs some pandas magic to be nice but here we are.

#+END_SRC

#+RESULTS: pm4py4test-fitness_df
:RESULTS:
# [goto error]
#+BEGIN_EXAMPLE

ValueErrorTraceback (most recent call last)
<ipython-input-16-547ba30fc075> in <module>
      2 transitiondf.drop(columns="level_0",inplace=True)
      3 #i would use orient=column here but this way it fills the empty times with NaNs.
----> 4 transitiondf.columns=["transition","time","weight"]
      5 transitiondf["transition"] = transitiondf["transition"].astype("category",inplace=True)
      6 #replace all the nans in a groups with the mean of that group.

~/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py in __setattr__(self, name, value)
   5078         try:
   5079             object.__getattribute__(self, name)
-> 5080             return object.__setattr__(self, name, value)
   5081         except AttributeError:
   5082             pass

pandas/_libs/properties.pyx in pandas._libs.properties.AxisProperty.__set__()

~/anaconda3/lib/python3.7/site-packages/pandas/core/generic.py in _set_axis(self, axis, labels)
    636 
    637     def _set_axis(self, axis, labels):
--> 638         self._data.set_axis(axis, labels)
    639         self._clear_item_cache()
    640 

~/anaconda3/lib/python3.7/site-packages/pandas/core/internals/managers.py in set_axis(self, axis, new_labels)
    153             raise ValueError(
    154                 'Length mismatch: Expected axis has {old} elements, new '
--> 155                 'values have {new} elements'.format(old=old_len, new=new_len))
    156 
    157         self.axes[axis] = new_labels

ValueError: Length mismatch: Expected axis has 2 elements, new values have 3 elements
#+END_EXAMPLE
:END:

